[
    {
        "name":"SBCCOPManager",
        "title":"Social Behaviour and Community Outreach Programme Manager",
        "category":"NULL Category",
        "image":"data/images/SBCCOPManager.jpeg",
        "largeImage":"data/images/SBCCOPManager.jpeg",
        "description": "Since Wotesawa establishment, 559 cases of abuse and exploitation of Child Domestic Workers were received, among them 10 cases have been worn in the Court of Law and the rest were resolved amicably through Police and Social Welfare Departments. Within this period, a total of 315 victims of abuse and exploitation were re-unified to their families,among them 150 victims were re-enrolled back to primary schools. Some times significant reduction was seen in cases of abuse and exploitation of Child Domestic Workers. Wotesawa together with its stakeholder is still using different intervention strategies to eradicate /reduce abuse and exploitation to Child Domestic Workers. So far Wotesawa has been able to mobilize hundreds of CDWs and children Victims of abuse and exploitation and no victims to amplify their collective voice and to redress challenges they are facing as child domestic workers. The Wotesawa Organization managed to establish a shelter for the temporarily stay of the victims of abuse, Wotesawa offers protection at an established shelter as well as psycho social support, medical support, legal assistance and reintegration with their families .Also Wotesawa Organization has established a unique participatory and empowerment strategy where CDWs are mobilized and advocate for their own rights at community and institutional levels. This is achieved through Advisory Committees of Child Domestic Workers. Moreover, Wotesawa is successfully interacting with government institutions, law enforcers and Community Based Organizations for addressing the rights of child victims of abuse on emphasis to child domestic workers. With most vulnerable CDWs being victims of abuse and all forms of exploitation, Wotesawa is working in collaboration with various stakeholders to achieve planned objectives."
    }
]